# """"""" задача 1.1 преобразовать число 53 в двоичную, 8-ую, 16-ую СС """""""
# int_1 = 53
# print(f"{int_1} в двоичной СС равна:", bin(int_1))
# print(f"{int_1} в восьмеричной СС равна:", oct(int_1))
# print(f"{int_1} в шестнадцатеричной СС равна:", hex(int_1))
#
# """"""" Задача 1.2 """""""
# a = 0b011011101
# b = 0o357
# c = 0xAF23D
# print(f"число а в десятичной СС равна:", int(a))
# print(f"число b в десятичной СС равна:", int(b))
# print(f"число c в десятичной СС равна:", int(c))
#
# """"""" Задача 1.3 """""""
# num_oct = str(1372)
# print("Число 1372(8-ая СС) в десятичной СС равна:", int(num_oct, base=8))

""""""" Задача 1.7 """""""
# a = 3.79
# b = 84.93
# res = a + b
# res_1 = a * b
# res_2 = a / b
# res_3 = a - b
# print(round(res, 2))
# print(round(res_1, 2))
# print(round(res_2, 2))
# print(round(res_3, 2))

""""""""" Задача 3.01 """""""""
# print("Программа нахождения наибольшего из двух чисел")
# a, b = map(int, input("Введите два числа -> ").split())
# if a > b:
#     print("Большее число -", a)
# else:
#     print("Большее число -", b)

""""""""" Задача 3.02 """""""""
# print("Программа вывода следующего четного числа")
# n = int(input("Введите число -> "))
# if n % 2 == 0:
#     print(n + 2)
# else:
#     print(n + 1)

""""""""" Задача 3.03 """""""""
# print("Программа нахождения наименьшего из трех чисел")
# a, b, c = map(int, input("Введите три числа -> ").split())
# if a < b and a < c:
#     print("Наименьшее из трех чисел:", a)
# elif b < a and b < c:
#     print("Наименьшее из трех чисел:", b)
# else:
#     print("Наименьшее из трех чисел:", c)

""""""""" Задача 3.04 """""""""
# print("Программа нахождения количества четных чисел")
# a, b, c, d = map(int, input("Введите четыре числа -> ").split())
# k = 0
# if a % 2 == 0:
#     k += 1
# if b % 2 == 0:
#     k += 1
# if c % 2 == 0:
#     k += 1
# if d % 2 == 0:
#     k += 1
# print("Кол-во четных чисел в наборе -", k)

""""""""" Задача 3.06 """""""""
# print("Программа нахождения суммы положительных чисел")
# a, b, c, d, e, f = map(int, input("Введите шесть чисел -> ").split())
# res = 0
# if a > 0:
#     res += a
# if b > 0:
#     res += b
# if c > 0:
#     res += c
# if d > 0:
#     res += d
# if e > 0:
#     res += e
# if f > 0:
#     res += f
# print("Сумма положительных чисел в наборе:", res)

""""""""" Задача 3.07 """""""""
# print("Программа для определения координатной четверти")
# x, y = map(float, input("Введите координаты точки -> ").split())
# if x > 0 and y > 0:
#     print("I четверть")
# if x < 0 and y > 0:
#     print("II четверть")
# if x < 0 and y < 0:
#     print("III четверть")
# if x > 0 and y < 0:
#     print("IV четверть")

""""""""" Задача 3.08 """""""""
# print("Программа для определения координат вершины прямоугольника")
# x1, y1 = map(int, input("Введите координаты первой точки -> ").split())
# x2, y2 = map(int, input("Введите координаты второй точки -> ").split())
# x3, y3 = map(int, input("Введите координаты третьей точки -> ").split())
# if x1 == x2:
#     x4 = x3
# if x2 == x3:
#     x4 = x1
# if x3 == x1:
#     x4 = x2
# if y1 == y2:
#     y4 = y3
# if y2 == y3:
#     y4 = y1
# if y3 == y1:
#     y4 = y2
# print("Координаты четвертой точки:", x4, y4)

""""""""" Задача 3.09 """""""""
# print("")
# a, b, c = map(int, input("Введите стороны треугольника -> ").split())
# if a < b + c and b < a + c and c < a + b:
#     print("Треугольник существует")
# else:
#     print("Треугольник не существует")

""""""""" Задача 3.10 """""""""
# from math import sin
# print("Программа для определения значения функции")
# x = int(input("Введите значение переменной x -> "))
# if x > 0:
#     f = 3 * sin(x)
# else:
#     f = 1 - sin(x)
# f = round(f, 3)
# print("f(", x, ")=", f)

""""""""" Задача 3.11 """""""""
# print("Программа определения числа")
# n = int(input("Введите число -> "))
# if 0 < n < 10 and n % 2 == 0:
#     print("Четное число")
# if 0 < n < 10 and n % 2 == 1:
#     print("Нечетное число")
# if 10 < n < 100 and n % 2 == 0:
#     print("Четное двухзначное число")
# if 10 < n < 100 and n % 2 == 1:
#     print("Нечетное двухзначное число")
# if 99 < n < 1000 and n % 2 == 0:
#     print("Четное трехзначное число")
# if 99 < n < 1000 and n % 2 == 1:
#     print("Нечетное трехзначное число")
# if 999 < n < 10000 and n % 2 == 0:
#     print("Четное четырехзначное число")
# if 999 < n < 10000 and n % 2 == 1:
#     print("Нечетное четырехзначное число")

""""""" или """""""
# print("Программа определения числа")
# n = int(input("Введите число -> "))
# if n % 2 == 0:
#     print("четное", end=" ")
# else:
#     print("нечетное", end=" ")
# if n < 10:
#     print("однозначное число")
# elif 10 <= n < 100:
#     print("двузначное число")
# elif 100 <= n < 1000:
#     print("трехзначное число")
# else:
#     print("четырехзначное число")

""""""""" Задача 3.12 """""""""
# print("Программа определения месяца")
# n = int(input("Введите номер месяца -> "))
# if n == 4 or n == 6 or n == 11:
#     d = 30
# elif n == 2:
#     d = 28
# else:
#     d = 31
# if n == 1:
#     print("Январь", d, "дн.")
# if n == 2:
#     print("Февраль", d, "дн.")
# if n == 3:
#     print("Март", d, "дн.")
# if n == 4:
#     print("Апрель", d, "дн.")
# if n == 5:
#     print("Май", d, "дн.")
# if n == 6:
#     print("Июнь", d, "дн.")
# if n == 7:
#     print("Июль", d, "дн.")
# if n == 8:
#     print("Август", d, "дн.")
# if n == 9:
#     print("Сентябрь", d, "дн.")
# if n == 10:
#     print("Октябрь", d, "дн.")
# if n == 11:
#     print("Ноябрь", d, "дн.")
# if n == 12:
#     print("Декабрь", d, "дн.")

""""""""" Задача 4.01 """""""""
# print("Программа вывода чисел на экран")
# n = int(input("n-> "))
# for i in range(1, n+1):
#     print(i, end=" ")

""""""""" Задача 4.02 """""""""
# print("Программа вывода квадратов чисел на экран")
# n = int(input("n-> "))
# for i in range(1, n+1):
#     print(i ** 2)

""""""""" Задача 4.03 """""""""
# print("Программа вывода чисел в порядке убывания")
# a, b = map(int, input("Введите два числа -> ").split())
# for i in range(b, a - 1, -1):
#     print(i, end=" ")

""""""""" Задача 4.04 """""""""
# print("Таблица соответствия ярды - метры")
# print("Ярды", "Метры")
# for i in range(1, 10):
#     print(i, i * 0.9144, sep="    ")

""""""""" Задача 4.05 """""""""
# print("Программа вывода таблицы умножения")
# n = int(input("Введите число -> "))
# for i in range(1, 10):
#     print(i, "X", n, "=", i * n, sep=" ")

""""""""" Задача 4.06 """""""""
# print("Программа вывода четных чисел")
# a, b = map(int, input("Введите два числа -> ").split())
# for i in range(a, b + 1):
#     if i % 2 == 0:
#         print(i, end=" ")

""""""""" Задача 4.07 """""""""
# print("Программа вывода чисел на экран")
# for i in range(10, 100):
#     if i % 10 == 2 or i % 10 == 6:
#         print(i, end=" ")

""""""""" Задача 4.08 """""""""
# print("Программа вывода чисел на экран")
# n = int(input("Введите число -> "))
# for i in range(10, 100):
#     if (i // 10) + (i % 10) == n:
#         print(i, end=" ")

""""""""" Задача 4.09 """""""""
# print("Программа вывода чисел")
# a, b, c = map(int, input("Введите числа a,b,c -> ").split())
# k = 0
# for i in range(a, b + 1):
#     if i % c == 0:
#         k += 1
#         print(i, end=" ")
# print()
# print("\nКол-во кратных чисел -", k)

""""""""" Задача 4.10 """""""""
# s = 0
# for i in range(101, 1000, 2):
#     s += i
# print(s)

""""""""" Задача 4.11 """""""""
# print("Программа вывода факториала числа")
# n = int(input("Введите число -> "))
# k = 1
# for i in range(1, n + 1):
#     k = k * i
# print(f"{n}! =", k, sep=" ")

""""""""" Задача 4.12 """""""""
# print("Программа вывода чисел Фибоначи")
# a1 = 1
# a2 = 1
# n = int(input("Введите число -> "))
# print(a1, end=" ")
# print(a2, end=" ")
# for i in range(3, n + 1):
#     c = a1 + a2
#     print(a1 + a2, end=" ")
#     a1 = a2
#     a2 = c

""""""""" Задача 5.01 """""""""
# print("Программа вывода чисел на экран")
# n = int(input("Введите число -> "))
# i = 1
# while i <= n:
#     print(i, end=" ")
#     i += 1

""""""""" Задача 5.02 """""""""
# print("Программа вывода четных чисел")
# a, b = map(int, input("Введите два числа -> ").split())
# i = a
# while i <= b:
#     if i % 2 == 0:
#         print(i, end=" ")
#     i += 1

""""""""" Задача 5.03 """""""""
# print("Программа определения суммы цифр числа")
# n = int(input("Введите число -> "))
# res = 0
# while n != 0:
#     a = n % 10
#     res += a
#     n //= 10
# print("Сумма цифр данного числа равна", res)

""""""""" Задача 5.04 """""""""
# print("Программа определения количества цифр числа")
# n = int(input("Введите число n -> "))
# s = 0
# while n != 0:
#     s += 1
#     n //= 10
# print("Кол-во цифр в числе равно", s)

""""""""" Задача 5.05 """""""""
# print("Программа определения произведения цифр числа")
# n = int(input("Введите число -> "))
# s = 1
# while n != 0:
#     a = n % 10
#     s *= a
#     n //= 10
#
# print("Произведение цифр данного числа равно:", s)

""""""""" Задача 5.06 """""""""
# print("Программа вывода цифр числа")
# n = int(input("Введите число -> "))
# print("Цифры числа:")
# while n != 0:
#     a = n % 10
#     print(a, end=" ")
#     n //= 10

""""""""" Задача 5.07 """""""""
# print ('Программа прочтения числа справа налево')
# n = int(input('Введите число n -> '))
# print('Число справа налево:', end=' ')
# k = 0                      # сначала определим разрядность числа
# n2 = n                     # создаем копию числа n
# while n2 != 0:
#     n2 //= 10
#     k += 1                 # k - разрядность числа n
#
# n3 = 0                          # n3 - переменная для числа - "перевертыша"
# for i in range(k - 1, -1, -1):  # i "пробегает" все значения разряда от k-1 до 0
#     a = n % 10                  # остаток от деления на 10
#     n3 = n3 + a * 10 ** i       # умножаем на 10 в степени i
#     n //= 10                    # отбрасываем последнюю цифру числа
# print(n3)

""""""""" Задача 5.08 """""""""
# print("Программа определения цифры 5 в числе")
# n = int(input("Введите число -> "))
# f = 0
# while n != 0:
#     a = n % 10
#     if a == 5:
#         print("Да")
#         f = 1
#         break
#     n //= 10
# if f != 1:
#     print("Нет")

""""""""" Задача 5.09 """""""""
# print("Программа нахождения произведения чисел")
# p = 1
# n = int(input("Введите число -> "))
# while n != 0:
#     p *= n
#     n = int(input("Введите число -> "))
# print("Произведение чисел равно", p)

""""""""" Задача 5.10 """""""""
# print("Программа вывода квадратов чисел")
# n = int(input("Введите число -> "))
# i = 1
# while (i ** 2) <= n:
#     print(i ** 2, end=" ")
#     i += 1

""""""""" Задача 5.11 """""""""
# print("Программа определения простого числа")
# n = int(input("Введите число -> "))
# p = 2
# f = 1
# while p <= (n ** 0.5):
#     if n / p == int(n / p):
#         print("Нет")
#         f = 0
#         break
#     p += 1
# if f == 1:
#     print("Да")